In [4]:
import pandas as pd

In [13]:
dataset = {"Name" : ["Rohit", "Aditya", "Dinkar"], "Age" : [22, 36, 25], "Gender" : ["male", "female", "male"]}

In [14]:
df=pd.DataFrame(data=dataset)

In [15]:
df

     Name  Age  Gender
0   Rohit   22    male
1  Aditya   36  female
2  Dinkar   25    male

In [11]:
x = df['Name']

In [12]:
x

0     Rohit
1    Aditya
2    Dinkar
Name: Name, dtype: object

In [13]:
y = df['Age']
y.max()

36

In [14]:
res = df['Age']
res.max()

36

In [15]:
df['Age']

0    22
1    36
2    25
Name: Age, dtype: int64

In [16]:
df['Age'].max()

36

In [20]:
ages = pd.Series([22,36,25], name='Name')

In [11]:
df

NameError: name 'df' is not defined

In [18]:
df.describe()

             Age
count   3.000000
mean   27.666667
std     7.371115
min    22.000000
25%    23.500000
50%    25.000000
75%    30.500000
max    36.000000

In [8]:
s1=pd.Series(("A","B","ER"),name="RollNo")

In [9]:
s1

0     A
1     B
2    ER
Name: RollNo, dtype: object

In [16]:
s2=df["Name"]

In [17]:
s2

0     Rohit
1    Aditya
2    Dinkar
Name: Name, dtype: object

In [18]:
m1 = df['Age']

In [19]:
m1

0    22
1    36
2    25
Name: Age, dtype: int64

In [20]:
m2 = df['Gender']
m2

0      male
1    female
2      male
Name: Gender, dtype: object

In [21]:
s4 = pd.Series([23,44,46], name = "Roll No")
s4

0    23
1    44
2    46
Name: Roll No, dtype: int64

In [22]:
df.describe()

             Age
count   3.000000
mean   27.666667
std     7.371115
min    22.000000
25%    23.500000
50%    25.000000
75%    30.500000
max    36.000000

In [28]:
hello = {"country" : ["Brazil", "Russia", "India", "China", "South Africa"],
"capital" : ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area": [8.516, 17.10, 3.286, 9.67, 2.98],
"population" : [200.4, 143.5, 1252, 133, 4.3]
        }

In [29]:
hii = pd.DataFrame(hello)
hii

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [30]:
hii.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
hii.index = range(2,12,2)

In [33]:
hii

         country    capital    area  population
2         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
6          India  New Delhi   3.286      1252.0
8          China    Beijing   9.670       133.0
10  South Africa   Pretoria   2.980         4.3

In [34]:
hii.shape

(5, 4)

In [36]:
hii.reset_index(1,6,1)

TypeError: DataFrame.reset_index() takes from 1 to 2 positional arguments but 4 were given